artillery-full.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 15
      name: "Ramp up"
    - duration: 120
      arrivalRate: 30
      name: "Sustained load"
    - duration: 30
      arrivalRate: 5
      name: "Cool down"

scenarios:
  - name: "Mixed workload - List products"
    weight: 40
    flow:
      - get:
          url: "/demo/produtos?page={{ $randomNumber(1, 10) }}&limit=10"
      - think: 2

  - name: "Mixed workload - Product detail"
    weight: 30
    flow:
      - get:
          url: "/demo/produtos/{{ $randomNumber(1, 500) }}"
      - think: 3

  - name: "Mixed workload - External API"
    weight: 20
    flow:
      - get:
          url: "/demo/externo"
      - think: 5

  - name: "Mixed workload - Health check"
    weight: 10
    flow:
      - get:
          url: "/health"
      - think: 1