artillery-produtos.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Test pagination and cache"

scenarios:
  - name: "List products with pagination"
    flow:
      - get:
          url: "/demo/produtos?page=1&limit=10"
      - think: 1
      - get:
          url: "/demo/produtos?page=2&limit=10"
      - think: 1
      - get:
          url: "/demo/produtos?page=1&limit=20"